<h1 style="text-align: center">Автор</h1>
<p class="justify">Я, Ковчук Павло Васильович, народився 17 березня 1992 року в м. Чернівці, Чернівецької області (Україна).
    Не одружений</p>
<p class="justify">У 1998 році пішов у перший клас Чернівецької середньої школи №40 в рідному місті Чернівці, а в 2004
    році вступив до Чернівелького фізико-математичного ліцею №1. В 2008 році отримав повну середню освіту і вступив до
    Чернівецького торговельно-економічного інституту КНТЕУ на спеціальність економічна кібернетика, який успішно закінчив
    у 2013 році захистивши магістерську роботу на тему "Створення інтернет магазину товарів легкої промисловості засобами
    PHP та MySQL" і отримав диплом магістра за спеціальністю економічна кібернетика. Під час навчання в інституті
    неодноразово брав участь у всеукраїнських олімпіадах по математиці та програмуванню.</p>
<p class="justify">02/2014 - 04/2015 працював офіціантом-барменом у ресторані "Peppercrab" в Дубай (ОАЕ).</p>
<p class="justify">07/2015 - 10/2015 PHP програміст в команді GabSoft, Чернівці (Україна).</p>
<p class="justify">11/2015 - 11/2016 служба в армії (радіо-технічні війська ППО).</p>
<ul>Вміння та навички:
    <li>базові знання PHP, MySQL, HTML, CSS, JavaScript, C++</li>
    <li>досвід роботи з патерном MVC, PhpStorm, Git, Photoshop</li>
    <li>середній рівень англійської мови</li>
</ul>
<p>тел.: +38(099) 345-37-07<br/>E-mail: bihhi.iiyx@gmail.com</p>