<p class="justify"><strong>Завдання 1</strong><br/>
    У форму вводиться число N. Знайти всі досконалі числа до N. Досконале число - це таке число, що дорівнює сумі всіх своїх дільників, крім себе самого. Наприклад, число 6 є досконалим, тому що крім себе самого ділиться на числа 1, 2 і 3, які в сумі дають 6.
</p>
<hr/>
<p class="justify"><strong>Завдання 2</strong><br/>
    У форму вводиться текст, слова в якому розділені пробілами і розділовими знаками. Вилучити з цього тексту всі слова найбільшої довжини. (Слів найбільшої довжини може бути декілька).
</p>
<hr/>
<p class="justify"><strong>Завдання 3</strong><br/>
    Вводяться N натуральних чисел більше 2. Підрахувати, скільки серед них простих чисел.
</p>
<hr/>
<p class="justify"><strong>Завдання 4</strong><br/>
    Політичне життя однієї країни дуже жваве. У країні діє К політичних партій, кожна з яких регулярно оголошує національний страйк. Дні, коли хоча б одна з партій оголошує страйк, за умови, що не субота або неділя (коли і так ніхто не працює), завдають великої шкоди економіці країни.<br/>
    і-та партія оголошує страйки строго кожні bі днів, починаючи з дня з номером аі. Тобто і-та партія оголошує страйки в дні аі, аі+bi, ai+2bi і т.д. Якщо в якийсь день кілька партій оголошує страйк, то це вважається загальнонаціональним страйком.<br/>
    У календарі країни N днів, пронумерованих від 1 до N. Перший день року є понеділком, шостий і сьомий дні року - вихідні, тиждень складається з семи днів.<br/><br/>
    <strong>Вхідні дані</strong><br/>
    Програма отримує на вхід число днів в році N (1	&lt;N&lt;1000000) і число політичних партій К (1&lt;K&lt;100). Далі йде К рядків, що описують графіки проведення страйків. і-й рядок містить числа аі і bi (1&lt;ai,bi&lt;N).<br/>
    <strong>Вихідні дані</strong><br/>
    Виведіть єдине число: кількість страйків, що відбулися протягом року.<br/><br/>
    <strong>Примітка</strong><br/>
    Перша партія оголошує страйки в дні 2, 5, 8, 11, 14, 17. Друга партія оголошує страйки в дні 3, 8, 13, 18. Третя партія - в дні 9 і 17. Дні номер 6, 7, 13, 14 є вихідними. Таким чином, загальнонаціональні страйки пройдуть в дні 2, 3, 5, 8, 9, 11, 17, 18.
</p>
<hr/>
<p class="justify"><strong>Завдання 5</strong><br/>
    Задано текст. Словом вважається послідовність непробільних символів, які йдуть підряд. Слова розділені одним або більшим числом пробілів або символами кінця рядка.<br/>
    Для кожного слова з цього тексту підрахуйте, скільки разів воно зустрічалось в цьому тексті раніше. Використайте словники.<br/><br/>
    <strong>Приклад:</strong><br/>
</p>
<table class="border">
    <tr>
        <td><strong>Ввід</strong></td>
        <td><strong>Вивід</strong></td>
    </tr>
    <tr>
        <td>one two one two three</td>
        <td>0 0 1 1 0</td>
    </tr>
    <tr>
        <td>She sells sea shells on the sea shore;<br/>The shells that she sells are sea shells I'm sure.<br/>So if she sells sea shells on the sea shore,<br/> I'm sure that the shells are sea shore shells.</td>
        <td>0 0 0 0 0 0 1 0 0 1 0 0 1 0 2 2 0 0 0 0 1 2 3 3 1 1 4 0 1 0 1 2 4 1 5 0 0</td>
    </tr>
</table>
<hr/>
<p class="justify"><strong>Завдання 6</strong><br/>
    Змагання з гри "Тетріс онлайн" проводяться за такими правилами:<br/>
    Кожен учасник реєструється на сайті гри під певним ігровим ім'ям. Імена учасників не повторяються.<br/>
    Чемпіонат проводиться протягом певного часу. У будь-який момент цього часу будь-який зареєстрований учасник може зайти на сайт чемпіонату і почати залікову гру. Після закінчення гри її результат (кількість балів) фіксується і заноситься до протоколу.<br/>
    Учасники мають право грати кілька разів. Кількість спроб одного участника не обмежується. Остаточний результат учасника визначається по одній грі, кращою для даного учасника. Більш високе місце в змаганнях займає учасник, що показав кращий результат. При рівності результатів більш високе місце займає учасник, раніше показав кращий результат<br/>
    В ході змагань заповнюється протокол, кожен рядок якого описує одну гру і містить результат учасника і його ігрове ім'я. Протокол формується в реальному часі по ходу проведення чемпіонату, тому рядки в ньому розташовані в порядку проведення ігор: чим раніше зустрічається рядок у протоколі, тим раніше закінчилась відповідна цьому рядку гра.<br/>
    Напишіть програму, яка за даними протоколу визначає переможця і призерів. Гарантується, що в чемпіонаті бере участь не менше трьох гравців.<br/><br/>
    <strong>Приклад:</strong>
</p>
    <table>
        <tr>
            <td><strong>Ввід</strong></td>
            <td><strong>Вивід</strong></td>
        </tr>
        <tr>
            <td>
                9<br/>
                69485 Jack<br/>
                95715 qwerty<br/>
                95715 Alex<br/>
                83647 M<br/>
                197128 qwerty<br/>
                95715 Jack<br/>
                93289 Alex<br/>
                95715 Alex<br/>
                95715 M
            </td>
            <td style="vertical-align: top">
                1 місце. Qwerty (197128)<br/>
                2 місце. Alex (95715)<br/>
                3 місце. Jack (95715)
            </td>
        </tr>
    </table>