<p class="justify"><h1>Завдання 4</h1>
    Політичне життя однієї країни дуже жваве. У країні діє К політичних партій, кожна з яких регулярно оголошує національний страйк. Дні, коли хоча б одна з партій оголошує страйк, за умови, що не субота або неділя (коли і так ніхто не працює), завдають великої шкоди економіці країни.<br/>
    і-та партія оголошує страйки строго кожні bі днів, починаючи з дня з номером аі. Тобто і-та партія оголошує страйки в дні аі, аі+bi, ai+2bi і т.д. Якщо в якийсь день кілька партій оголошує страйк, то це вважається загальнонаціональним страйком.<br/>
    У календарі країни N днів, пронумерованих від 1 до N. Перший день року є понеділком, шостий і сьомий дні року - вихідні, тиждень складається з семи днів.<br/><br/>
    <strong>Вхідні дані</strong><br/>
    Програма отримує на вхід число днів в році N (1	&lt;N&lt;1000000) і число політичних партій К (1&lt;K&lt;100). Далі йде К рядків, що описують графіки проведення страйків. і-й рядок містить числа аі і bi (1&lt;ai,bi&lt;N).<br/>
    <strong>Вихідні дані</strong><br/>
    Виведіть єдине число: кількість страйків, що відбулися протягом року.<br/><br/>
    <strong>Примітка</strong><br/>
    Перша партія оголошує страйки в дні 2, 5, 8, 11, 14, 17. Друга партія оголошує страйки в дні 3, 8, 13, 18. Третя партія - в дні 9 і 17. Дні номер 6, 7, 13, 14 є вихідними. Таким чином, загальнонаціональні страйки пройдуть в дні 2, 3, 5, 8, 9, 11, 17, 18.
</p>
<hr/>

<form action="" method="post">
    <label>Число політичних партій:</label><br/>
    <input type="number" name="k" value="<?php echo $k; ?>"/><br/><br/>
    <label>Число днів в році:</label><br/>
    <input type="number" name="n" value="<?php echo $n; ?>"/><br/><br/>
    <label>Графіки проведення страйків:</label><br/>
    <textarea cols="120" rows="5" name="rules"><?php echo $rules; ?></textarea><br/><br/>
    <input type="submit" value="Підрахувати"/><br/><br/>
    <input type="hidden" name="ex" value="<?php echo $content; ?>">
</form>
<div>
    <?php
    if(count($results) != 0){
        echo 'Кількість страйків, що відбулись протягом року: ' . count($results);
    } else {
        echo 'Дані відсутні!';
    }
    ?>
</div>
