<p class="justify"><h1>Завдання 6</h1>
    Змагання з гри "Тетріс онлайн" проводяться за такими правилами:<br/>
    Кожен учасник реєструється на сайті гри під певним ігровим ім'ям. Імена учасників не повторяються.<br/>
    Чемпіонат проводиться протягом певного часу. У будь-який момент цього часу будь-який зареєстрований учасник може зайти на сайт чемпіонату і почати залікову гру. Після закінчення гри її результат (кількість балів) фіксується і заноситься до протоколу.<br/>
    Учасники мають право грати кілька разів. Кількість спроб одного участника не обмежується. Остаточний результат учасника визначається по одній грі, кращою для даного учасника. Більш високе місце в змаганнях займає учасник, що показав кращий результат. При рівності результатів більш високе місце займає учасник, раніше показав кращий результат<br/>
    В ході змагань заповнюється протокол, кожен рядок якого описує одну гру і містить результат учасника і його ігрове ім'я. Протокол формується в реальному часі по ходу проведення чемпіонату, тому рядки в ньому розташовані в порядку проведення ігор: чим раніше зустрічається рядок у протоколі, тим раніше закінчилась відповідна цьому рядку гра.<br/>
    Напишіть програму, яка за даними протоколу визначає переможця і призерів. Гарантується, що в чемпіонаті бере участь не менше трьох гравців.<br/><br/>
    <strong>Приклад:</strong>
</p>
<table>
    <tr>
        <td><strong>Ввід</strong></td>
        <td><strong>Вивід</strong></td>
    </tr>
    <tr>
        <td>
            9<br/>
            69485 Jack<br/>
            95715 qwerty<br/>
            95715 Alex<br/>
            83647 M<br/>
            197128 qwerty<br/>
            95715 Jack<br/>
            93289 Alex<br/>
            95715 Alex<br/>
            95715 M
        </td>
        <td style="vertical-align: top">
            1 місце. Qwerty (197128)<br/>
            2 місце. Alex (95715)<br/>
            3 місце. Jack (95715)
        </td>
    </tr>
</table><br/>
<hr/>

<form action="" method="post">
    <table>
    <tr>
        <td><label>Ввід:</label></td>
        <td><label>Вивід:</label></td>
    </tr>
    <tr>
        <td><textarea cols="50" rows="10" name="text"><?php echo $text ?></textarea></td>
        <td><textarea cols="50" rows="10" name="result"><?php echo $result; ?></textarea><td>
    </tr>
    <tr>
        <td><input type="submit" value="Підрахувати"/>
            <input type="hidden" name="ex" value="<?php echo $content; ?>"><td>
    </tr>
    </table>
</form>